In [1]:
import pandas as pd
import numpy as np

In [3]:
jobs=pd.read_csv("jobs_dataset.csv")
skills=pd.read_csv("skills_dataset.csv")

In [5]:
jobs.head()

,job_id,job_title,company_type,industry,country,city,remote_type,experience_level,min_experience_years,salary_min_usd,salary_max_usd,employment_type,posted_year,company_size
0,0IFD0TVBDIVU,MLOps Engineer,Research Lab,Education,Australia,Remote,Remote,Entry,0,56873,72223,Full-time,2023,Large
1,ZMF8MDD4V30T,Data Analyst,Startup,Education,Germany,Remote,Remote,Entry,0,54803,85599,Full-time,2024,Medium
2,CX1945NQ4FMY,MLOps Engineer,Research Lab,Tech,Canada,Remote,Remote,Senior,5,149980,175806,Full-time,2021,Large
3,QJ7YHL1C32OC,Applied Scientist,Research Lab,Healthcare,Australia,Remote,Remote,Entry,0,53483,86477,Full-time,2023,Medium
4,F0T0PVN9ER14,Machine Learning Engineer,Research Lab,Finance,Australia,Sydney,Hybrid,Mid,2,102977,127298,Full-time,2023,Large

In [7]:
skills.head()

         job_id            skill skill_category   skill_level
0  E0IFD0TVBDIV                R    Programming      Advanced
1  E0IFD0TVBDIV  Computer Vision             ML         Basic
2  E0IFD0TVBDIV              NLP             ML  Intermediate
3  E0IFD0TVBDIV              SQL    Programming  Intermediate
4  ZMF8MDD4V30T              NLP             ML      Advanced

In [9]:
jobs.shape

(50000, 14)

In [11]:
skills.shape

(224605, 4)

In [13]:
jobs.columns

Index(['job_id', 'job_title', 'company_type', 'industry', 'country', 'city',
       'remote_type', 'experience_level', 'min_experience_years',
       'salary_min_usd', 'salary_max_usd', 'employment_type', 'posted_year',
       'company_size'],
      dtype='object')

In [15]:
skills.columns

Index(['job_id', 'skill', 'skill_category', 'skill_level'], dtype='object')

In [17]:
jobs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 14 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   job_id                50000 non-null  object
 1   job_title             50000 non-null  object
 2   company_type          50000 non-null  object
 3   industry              50000 non-null  object
 4   country               50000 non-null  object
 5   city                  50000 non-null  object
 6   remote_type           50000 non-null  object
 7   experience_level      50000 non-null  object
 8   min_experience_years  50000 non-null  int64
 9   salary_min_usd        50000 non-null  int64
 10  salary_max_usd        50000 non-null  int64
 11  employment_type       50000 non-null  object
 12  posted_year           50000 non-null  int64
 13  company_size          50000 non-null  object
dtypes: int64(4), object(10)
memory usage: 5.3+ MB

In [19]:
skills.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 224605 entries, 0 to 224604
Data columns (total 4 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   job_id          224605 non-null  object
 1   skill           224605 non-null  object
 2   skill_category  224605 non-null  object
 3   skill_level     224605 non-null  object
dtypes: object(4)
memory usage: 6.9+ MB